﻿; ============================================================
;  备忘录桌面小组件 — Rainmeter Skin
;  [模块1 最终修正版 + 失败回退]
;
;  本版新增：刷新失败时不再显示“握手失败/暂无备忘录”等字样，
;  而是自动回退到“上一次成功抓到的内容”，直到下一次成功再更新。
;
;  实现思路（关键）：
;    1. [FetchMemos] 跑 curl，把原始输出写到 memo_raw.txt。
;    2. 用 IfMatch=• 判断“这次到底成没成功”——后端接口对每条有效
;       备忘录都会加 “• ” 前缀，所以“输出里含 •” = 真正拿到数据；
;       空响应或 curl 的报错文本（如 “handshake/握手 failed”）都不含 •。
;    3. 只有成功时才 [Commit] 把 raw 字节拷贝成 memo_good.txt
;       （copy 是纯字节复制，不破坏 UTF-8）。
;    4. 真正显示给用户的 [MemoList] 永远只读 memo_good.txt（经
;       [StashMemos] 读取）。失败时 good 文件原封不动 → 自然回退到
;       上次成功内容，绝不会冒出报错字样。
;
;  用法：把整个 MemoWidget 文件夹放进
;        Documents\Rainmeter\Skins\ 目录，右键 Refresh All。
;  依赖：系统需能在命令行直接调用 curl.exe（Win10 1803+ 自带）。
;  注意：本文件请以 UTF-8 编码保存（AccurateText=1 已开，无需 BOM）。
; ============================================================

[Rainmeter]
Update=#UpdateInterval#
AccurateText=1
DynamicWindowSize=1
; 刷新时先读一次 good 文件（立即显示上次内容），再去抓新数据
OnRefreshAction=[!CommandMeasure StashMemos "Run"][!CommandMeasure FetchMemos "Run"]

[Metadata]
Name=备忘录
Author=Claude
Information=显示备忘录标题清单（刷新失败时自动回退到上次成功的内容）
Version=5.1.0-fallback

; ── 可调参数 ──────────────────────────────────────────────
[Variables]
; 把下面这一行换成你自己部署的 Worker 网址
ApiUrl=https://memo-app.YOUR-SUBDOMAIN.workers.dev/api/widget
; 刷新间隔（毫秒）。
RefreshRate=60000
; [Rainmeter]的Update不是变量，不能用#Update#引用，
; 所以单独定义这个变量，Update= 和 Timer 的除法都引用它。
UpdateInterval=1000
WidgetWidth=300
WidgetHeight=420

; ── 定时器：每隔 RefreshRate 毫秒触发一次 FetchMemos 的 Run ──
; [教训] 之前用 Formula=1（恒为1）配合 IfEqualValue=1，条件从
; 一开始就为真、永远不会再变化，而 Rainmeter 的 IfXxxAction 只
; 在条件"由假变真"的那一刻触发一次，所以只响了一次就再没反应。
; 改成一个每秒自增的计数器，用取模判断是否到达刷新点——这样
; 条件会真正地"假→真→假→……"周期性跳变，才能反复触发。
[Timer]
Measure=Calc
Formula=(Timer+1)
DynamicVariables=1
IfCondition=(Timer % (#RefreshRate#/#UpdateInterval#)) = 0
IfTrueAction=[!CommandMeasure FetchMemos "Run"]

; ── 数据获取：curl 抓取 + 写原始文件，并用 “•” 判断成败 ──
; 关键：不再把抓到的内容直接喂给 [MemoList]。先落到 memo_raw.txt，
; 是否“成功”由 IfMatch=• 决定；只有成功才提交到 good 文件。
[FetchMemos]
Measure=Plugin
Plugin=RunCommand
Parameter=curl.exe -s -S -m 8 "#ApiUrl#"
State=Hide
Timeout=8000
OutputType=UTF8
; curl 的 stdout 同时落盘成原始文件（与抓取值同源、同为 UTF-8）
OutputFile=#CURRENTPATH#memo_raw.txt
DynamicVariables=1
; 含 “•” => 真正拿到了备忘录数据 => 提交（覆盖 good 文件）
IfMatch=•
IfMatchAction=[!CommandMeasure Commit "Run"]
; 不含 “•”（空响应 / curl 报错如“握手失败”等）=> 视为失败：
; 不提交，good 文件保持原样；只重新读取一次 good 让界面回退显示
IfNotMatchAction=[!CommandMeasure StashMemos "Run"]

; ── 提交：把刚抓到的成功内容从 raw 字节拷贝为 good ──
; copy /y 是纯文件字节复制，不经过 cmd 文本包装，UTF-8 完好无损。
; 拷完再触发 [StashMemos] 重读，界面才更新为新内容（避免读到半成品）。
[Commit]
Measure=Plugin
Plugin=RunCommand
Parameter=cmd.exe /c copy /y "#CURRENTPATH#memo_raw.txt" "#CURRENTPATH#memo_good.txt"
State=Hide
OutputType=UTF8
DynamicVariables=1
FinishAction=[!CommandMeasure StashMemos "Run"][!UpdateMeter *][!Redraw]

; ── 展示：始终读取 memo_good.txt（=最近一次成功的内容）──
; 这才是 [MemoList] 真正绑定的数据源。失败时这个文件不会被改写，
; 因此界面会自动停留在“上一次成功抓到的内容”上。
[StashMemos]
Measure=Plugin
Plugin=RunCommand
Parameter=cmd.exe /c type "#CURRENTPATH#memo_good.txt"
State=Hide
OutputType=UTF8
DynamicVariables=1
; good 文件为空（首次启动还没成功过）才显示“空提示”，否则显示列表
IfMatch=^\s*$
IfMatchAction=[!SetOption MemoList Hidden 1][!SetOption EmptyHint Hidden 0][!UpdateMeter *][!Redraw]
IfNotMatchAction=[!SetOption MemoList Hidden 0][!SetOption EmptyHint Hidden 1][!UpdateMeter *][!Redraw]
FinishAction=[!UpdateMeter *][!Redraw]

; ── 背景面板 / 文字样式 ───────────────────────────────────
[TitleBarStyle]
StringAlign=Left
StringFont=Microsoft YaHei UI
FontSize=15
FontColor=255,255,255,255
FontWeight=700
AntiAlias=1

[ItemStyle]
StringAlign=Left
StringFont=Microsoft YaHei UI
FontSize=12
FontColor=200,205,215,255
AntiAlias=1
ClipString=1

[DotStyle]
StringFont=Microsoft YaHei UI
FontSize=12
FontColor=99,102,241,255
AntiAlias=1

; ── Meters ────────────────────────────────────────────────
[Background]
Meter=Shape
Shape=Rectangle 0,0,#WidgetWidth#,#WidgetHeight#,14 | Fill Color 24,26,32,235 | StrokeWidth 1 | Stroke Color 255,255,255,18

[IconDot]
Meter=String
MeterStyle=DotStyle
X=18
Y=14
Text=📝

[TitleBar]
Meter=String
MeterStyle=TitleBarStyle
X=40
Y=14
Text=备忘录
LeftMouseUpAction=[!CommandMeasure FetchMemos "Run"]
ToolTipText=点击手动刷新

[RefreshHint]
Meter=String
MeterStyle=ItemStyle
X=(#WidgetWidth#-50)
Y=18
FontColor=130,135,148,255
FontSize=9
Text=点击刷新
LeftMouseUpAction=[!CommandMeasure FetchMemos "Run"]

[Divider]
Meter=Shape
Shape=Rectangle 16,42,(#WidgetWidth#-32),1 | Fill Color 255,255,255,28 | StrokeWidth 0

; ── 标题清单：绑定 [StashMemos]（good 文件内容），而不是实时抓取值 ──
; 这样刷新失败时它不会变成报错文字，而是保持上一次成功的内容。
[MemoList]
Meter=String
MeasureName=StashMemos
MeterStyle=ItemStyle
X=18
Y=54
W=(#WidgetWidth#-36)
H=(#WidgetHeight#-70)
ClipString=2
Text=%1
StringStyle=Normal
LineGap=4

[EmptyHint]
Meter=String
MeterStyle=ItemStyle
X=18
Y=54
FontColor=130,135,148,255
Text=正在连接备忘录服务…
Hidden=1
